<a href="https://colab.research.google.com/github/HKyeol/Python_study/blob/master/201221SQL%ED%8C%8C%EC%9D%B4%EC%8D%AC%EC%97%B0%EA%B2%B0(%EC%A4%91%EC%9A%94).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 148. 오라클과 파이썬 연동하기

---
```
                    연동
오라클 database ------------ 파이썬(통계구현, 시각화, 머신러닝, 업무자동화)
       ↓
 비즈니스 데이터 
(정형화된 데이터)

* 빅데이터 기사 시험: 데이터의 구조에 따른 종류 3가지
1. 정형화된 데이터 : rdbms에 저장된 데이터
        relational database management system
        (관계형 데이터 베이스 관리 시스템)
2. 반정형화 데이터 : html, 웹로그 데이터
3. 비정형화 데이터 : 텍스트(SNS), 동영상, 이미지 데이터
```

우리는 연동 안하고 emp2.csv로 저장해서 내려받음  
실시간으로 변한다고 하면 실시간으로 다운받아서 파이썬으로 볼 수가 없다. 연동해야한다.  
```
* 오라클과 파이썬을 연동하는 이유?
1. 오라클 데이터 베이스에서 실시간으로 변하는 데이터를 csv 파일로 매번 내리려면 자주 내려야 하므로 그냥 바로 연동합니다.

2. 파이썬의 여러 장점들을 이용해서 데이터를 분석할 수 있기 때문입니다. (통계구현, 시각화, 머신러닝 구현, 업무자동화)

3. 폐사진을 숫자로 변환해서 오라클 database에 저장합니다.
    이미지를 숫자로 변환해서 오라클 database에 저장합니다.
    db에 저장하고 관리를 합니다. os에 파일로 남겨만 두지 않습니다.
    db에 저장하면 장점이 백업과 복구를 할 수가 있습니다.
    그리고 좀 더 효율적으로 data를 관리를 할 수가 있습니다.
    os에 파일로 저장되어 있으면 바이러스에 노출될 수도 있습니다.
```

* 오라클과 파이썬 연동
1. 도스창을 열고 리스너의 상태를 확인합니다.  
```
리스너 상태 확인하는 명령어 : lsnrctl status
리스너 없다고 나오면: lsnrctl start(시작시키고 10분 기다려야 status 가능)
```
외부에서 오라클에 접속하려면 리스너를 통해야지만 접속이 됩니다. 리스너가 접속을 허용해주어야 접속이 되는 것입니다.  
리스너가 가지고 있는 정보 중 3가지를 확인해야 합니다.  
```
(DESCRIPTION=(ADDRESS=(PROTOCOL=TCP)(HOST=localhost)(PORT=1521)))에 연결되었습니다
리스너의 상태
여기서 host부분이 ip주소
port가 포트번호
"orcl" 서비스는 1개의 인스턴스를 가집니다.
여기서 ""안 부분이 서비스 이름
```
    1. ip 주소 (건물주소) : local host
    2. 포트번호 (건물안의 복도) : 1522
    3. 서비스 이름 (회사이름) : orcl
2. 위의 정보들을 이용해서 오라클 database에 접속을 해봅니다.
```
sqlplus system/oracle@localhost:1521/orcl
적고 scott tiger 순서대로 적으면 로그인
```
3. 아나콘다 프롬프트창을 열고 cx_Oracle 모듈을 설치합니다.
```
conda install cx_Oracle
```
4. 파이썬에서 오라클과 연동하는 코드를 작성한다.
(spyder에서 작성)
```
import cx_Oracle
import pandas as pd
dsn = cx_Oracle.makedsn("localhost",1521,'orcl')
```

In [ ]:
import cx_Oracle
import pandas as pd

dsn = cx_Oracle.makedsn("localhost",1521,'orcl') # 오라클 주소를 기입한다
db = cx_Oracle.connect('scott','tiger',dsn) # 오라클 접속 유저 정보
cursor = db.cursor() # 결과 데이터를 담을 메모리 이름을 cursor로 선언
cursor.execute(""" select * from emp """) # 더블쿼테이션"를 3개 써야한다.
                        # 작성한 쿼리문의 결과가 cursor 메모리에 담긴다.
row = cursor.fetchall() # cursor 메모리에 담긴 결과를 한번에 row 변수에 담는다.
emp = pd.DataFrame(row)
print(emp) # 와! 된다!

문제440. 위의 emp 테이블 전체를 select 했는데 전체를 다 select 하지 말고 아래의 쿼리의 결과만 select 하시오.
```
select empno, ename, sal, deptno
 from emp
```

In [ ]:
cursor.execute(""" select empno, ename, sal, deptno from emp """)
row = cursor.fetchall()
emp = pd.DataFrame(row)
print(emp)

문제441. dept 테이블의 모든 데이터를 조회하시오!

In [ ]:
cursor.execute(""" select * from dept """)
row = cursor.fetchall()
dept = pd.DataFrame(row)
print(dept)

문제442. 우리반 테이블(emp12)를 조회하시오

In [ ]:
cursor.execute(""" select * from emp12 """)
row = cursor.fetchall()
emp12 = pd.DataFrame(row)
print(emp12)

문제443. 월급이 1200 이상인 사원들의 이름과 월급을 출력하시오!

In [ ]:
cursor.execute(""" select * from emp where sal>=1200 """)
row = cursor.fetchall()
emp12 = pd.DataFrame(row)
print(emp12)

문제444. 사원 테이블에 월급을 막대그래프로 그리시오

In [ ]:
cursor.execute(""" select ename, sal from emp""")
row = cursor.fetchall()
emp = pd.DataFrame(row)
emp.columns = ['ename','sal']
emp.index = emp['ename']
emp.plot(kind = 'bar') # 막대그래프가 그려진다.

문제445. (점심시간 문제) 위의 그래프의 색깔을 변경하고 그래프를 올리세요

In [ ]:
cursor.execute(""" select ename, sal from emp""")
row = cursor.fetchall()
emp = pd.DataFrame(row)
emp.columns = ['ename','sal']
emp.index = emp['ename']
emp.plot(kind = 'bar',color ='red') # 막대그래프가 그려진다.

문제446. 직업과 직업별 최대월급

In [ ]:
cursor.execute(""" select job, max(sal) from emp group by job""")
row = cursor.fetchall()
emp = pd.DataFrame(row)
emp.columns = ['ename','sal']
emp.index = emp['ename']
emp.plot(kind = 'bar',color='red')

문제447. 직업, 직업별 토탈월급을 출력하는데 직업별 토탈월급이 높은 것부터 출력하시오.

In [ ]:
cursor.execute(""" select job, sum(sal) from emp group by job order by sum(sal) desc""")
row = cursor.fetchall()
emp = pd.DataFrame(row)
emp.columns = ['ename','sal']
emp.index = emp['ename']
print(emp)

문제448. 이름, 월급, 순위를 출력하는데 순위가 월급이 높은 사원순으로 순위를 부여하시오.

In [ ]:
cursor.execute(""" select ename,sal,rank() over(order by sal desc) from emp""")
row = cursor.fetchall()
emp = pd.DataFrame(row)
emp.columns = ['ename','sal']
emp.index = emp['ename']
print(emp)

문제449. 부서번호, 부서번호별 토탈월급을 출력하시오.

In [ ]:
cursor.execute(""" select deptno, sum(sal) from emp group by deptno""")
row = cursor.fetchall()
emp = pd.DataFrame(row)
emp.columns = ['ename','sal']
emp.index = emp['ename']
print(emp)

문제450. 위의 결과를 막대그래프로 시각화하시오.

In [ ]:
cursor.execute(""" select deptno, sum(sal) from emp group by deptno""")
row = cursor.fetchall()
emp = pd.DataFrame(row)
emp.columns = ['ename','sal']
emp.index = emp['ename']
emp.plot()

문제451. emp 테이블 전체를 출력하시오.

In [ ]:
cursor.execute(""" select * from emp""")
row = cursor.fetchall()
emp = pd.DataFrame(row)
colname = cursor.description
print(colname)

컬럼명 뽑아내기

In [ ]:
cursor.execute(""" select * from emp""")
row = cursor.fetchall()
emp = pd.DataFrame(row)
colname = cursor.description # 컬럼명을 가져온다.
col = []
for i in colname:
    col.append(i[0].lower())
print(col)

문제452. 위의 col 리스트에 담긴 컬럼명을 위의 데이터에 매핑시키시오.

In [ ]:
cursor.execute(""" select * from emp""")
row = cursor.fetchall()
#emp = pd.DataFrame(row)                    # 데이터 프레임으로 아래에서 만들거니까 뺐음
colname = cursor.description # 컬럼명을 가져온다.
col = []
for i in colname:
    col.append(i[0])
#emp.columns = col                          # 컬럼명만 바꾸기
emp = pd.DataFrame(list(row),columns=col)   # 행렬 전부 list(row)는 그냥 번호로 행
print(emp)

문제453. 위의 컬럼명을 이용해서 판다스 문법으로 이름과 월급을 출력하시오.

In [ ]:
result = emp[['ename','sal']]

In [ ]:
문제454. 월급이 3000 이상인 사원들의 이름과 월급을 출력하시오.

In [ ]:
print(emp[['ename','sal']][emp['sal']>=3000])

문제455. 이름과 부서위치를 출력하시오!(그냥 SQL로 작성해서 파이썬에서 출력되게)

In [ ]:
cursor.execute("""select e.ename, d.loc from emp e, dept d where e.deptno=d.deptno""")
row = cursor.fetchall()
emp = pd.DataFrame(row)
colname = cursor.description # 컬럼명을 가져온다.
col = []
for i in colname:
    col.append(i[0].lower())
emp = pd.DataFrame(list(row),columns=col)   # 행렬 전부 list(row)는 그냥 번호로 행
print(emp)

문제456. 부서위치, 부서위치별 토탈월급을 출력하시오.

In [ ]:
cursor.execute("""select d.loc, sum(e.sal) 
                   from emp e, dept d
                   where e.deptno=d.deptno
                   group by d.loc""")
row = cursor.fetchall()
emp = pd.DataFrame(row)
colname = cursor.description # 컬럼명을 가져온다.
col = []
for i in colname:
    col.append(i[0].lower())
emp = pd.DataFrame(list(row),columns=col)   # 행렬 전부 list(row)는 그냥 번호로 행
print(emp)

문제457. 위의 결과를 막대그래프로 시각화하시오!

In [ ]:
cursor.execute("""
               
select d.loc, sum(e.sal) 
    from emp e, dept d
    where e.deptno=d.deptno
    group by d.loc""")
    
row = cursor.fetchall()
emp = pd.DataFrame(row)
colname = cursor.description # 컬럼명을 가져온다.

emp = pd.DataFrame(row)
emp.index = list(emp[0]) # 하단에 도시 출력
emp.plot(kind='bar', color = 'red')

# 149. 파이썬과 mySQL 연동

현업에서는 오라클도 많이 쓰지만 mySQL도 많이 사용합니다.  
오라클은 가격이 많이 나가서 중요한 데이터(Business data) 오라클에 저장하고 상대적으로 덜 중요한 데이터는 mySQL에 저장합니다.  

* MySQL 실행하고 database를 생성하는 방법

mysql cmd 들어가기
```
create database orcl;
데이터베이스가 만들어진다.

use orcl;
database changed라고 나오면서 데이터베이스 사용할 수 있다.
```

emp 테이블 생성하는 방법
스크립트 복붙
select * from emp 하면 보인다.

문제458. 월급이 3000 이상인 사원들의 이름과 월급을 출력하시오.

In [ ]:
mysql> select ename,sal from emp where sal >= 3000;

오라클 SQL이랑 똑같다  

문제459. 직업이 SALESMAN인 사원들의 이름과 월급과 직업을 출력하는데 월급이 높은 사원부터 출력하시오.

In [ ]:
mysql> select ename, sal, job
    -> from emp
    -> order by sal desc;

문제460. 이름과 부서위치를 출력하시오

In [ ]:
mysql> select e.ename, d.loc
    -> from emp e, dept d
    -> where e.deptno = d.deptno;

문제461. JONES보다 더 많은 월급을 받는 사원들의 이름과 월급을 출력하시오

In [ ]:
mysql> select ename, sal
    -> from emp
    -> where sal > (select sal from emp where ename='jones');

문제462. 이름, 월급, 월급순위를 뽑아보시오

In [ ]:
mysql> select ename, sal, dense_rank() over(order by sal desc)
    -> from emp;

# Oracle과 MySQL 함수 비교
```
  Oracle     vs     MySQL
1. nvl              ifnull
2. sysdate          sysdate()
3. months_between   period_add
4. decode           if
5. rollup           with rollup
6. listagg          group_concat
```

문제463. 이름, 커미션을 출력하는데 커미션이 null인 사람들은 0으로 출력하시오

In [ ]:
mysql> select ename, ifnull(comm,0)
    -> from emp;

문제464. 오늘 날짜를 출력하시오.

In [ ]:
mysql> select sysdate();

설명: mySQL은 오라클과 같은 dual이 없음

문제465. 부서번호, 부서번호별 토탈월급을 출력하시오!

In [ ]:
mysql> select deptno, sum(sal)
    -> from emp
    -> group by deptno;

문제466. 위의 결과를 다시 출력하는데 맨 아래에 전체 토탈월급이 출력되게 하시오!

In [ ]:
mysql> select deptno, sum(sal)
    -> from emp
    -> group by deptno with rollup;

 **`※ 이제부터가 아주 중요`**

문제467. scott의 월급을 0으로 변경하세요

In [ ]:
mysql> update emp
    -> set sal = 0
    -> where ename = 'scott';

취소하고 싶으면?

In [ ]:
mysql> rollback;

근데 롤백이 안된다.
```
Query OK, 0 rows affected (0.00 sec)
```
이런 거지같은

※ 설명: mysql은 오라클과는 다르게 기본 자동커밋이 활성화 되어있다. 자동 커밋되어버려서 rollback을 할 수 없습니다.  
mySQL 사용자들이 많이 하는 실수 중 하나이니 주의할 것!  

문제468. 자동 커밋이 활성화 되어있는지 확인하세요.

In [ ]:
select @@autocommit;

설명: 숫자 1이라고 나오면 오토커밋이 켜져있는 것

문제469. 자동 커밋 기능을 끄세요.

In [ ]:
mysql> set autocommit = FALSE;

활성화를 확인해보면 0으로 바뀌어있다.  

문제470. KING의 월급을 0으로 변경하세요.

In [ ]:
mysql> update emp
    -> set sal = 0
    -> where ename = 'KING';

설명: mySQL을 켰으면 제일 먼저 확인해야 하는 것이 자동 커밋이 활성화 되었는지 확인하는게 아주 중요합니다.  

문제471. 오라클의 listagg 함수와 같은 기능은 group_concat을 이용해서 부서번호, 부서번호별로 속한 사원들의 이름을 가로로 출력하시오.

In [ ]:
mysql> select deptno, group_concat(ename separator ',') # separator부분은 없어도 된다.
    -> from emp
    -> group by deptno;

문제472. mySQL과 파이썬을 연동해서 MySQL의 emp 테이블을 파이썬으로 출력하시오.  
먼저 pymysql을 설치해야 한다. 아나콘다 프롬프트 창을 열고 설치 이후 작동.

In [ ]:
conda install pymysql

In [ ]:
import pymysql,pandas as pd

conn = pymysql.connect(host="localhost", user="root",password="oracle", db="orcl",charset="utf8")

curs = conn.cursor()
sql = "select * from emp"
curs.execute(sql)
rows = curs.fetchall()
colname = curs.description
col = []
for i in colname:
    col.append(i[0].lower())
emp = pd.DataFrame(list(rows),columns=col)
print(emp[['ENAME', 'SAL']] )

문제473. 직업, 직업별 토탈월급을 출력하시오.

In [ ]:
sql = "select job, sum(sal) from emp group by job"
curs.execute(sql)
rows = curs.fetchall()
colname = curs.description
col = []
for i in colname:
    col.append(i[0].lower())
emp = pd.DataFrame(list(rows),columns=col)
print(emp)

문제474. 위의 결과를 막대그래프로 시각화 하시오!

문제475. 오라클과 파이썬을 연동하여 아래의 사원들을 검색하시오.
이름과 월급과 부서번호와 자기가 속한 부서번호의 평균월급을 출력하는데 자신의 월급이 자기가 속한 부서번호의 평균월급보다 더 큰 사원들만 출력하시오.

In [ ]:
import cx_Oracle
import pandas as pd

dsn = cx_Oracle.makedsn("localhost",1521,'orcl')
db = cx_Oracle.connect('scott','tiger',dsn)
cursor = db.cursor()
cursor.execute("""
with data as (select ename, sal, deptno, avg(sal) over(partition by deptno) as avgsal
            from emp)
select *
    from data
    where sal > avgsal
    """) 
row = cursor.fetchall()
colname = cursor.description
col = []
for i in colname:
    col.append(i[0].lower())

emp = pd.DataFrame(list(row),columns=col)

print(emp)

# 150. 이미지를 숫자로 변환하는 방법 (폐사진)  

딥러닝 수업을 할 때 이미지를 인공신경망에 넣어서 학습을 시키는데 인공 신경망에 사진을 넣을 때 숫자로 변환을 해서 넣어야 합니다.  

c드라이브 밑에 images라는 폭더에 폐사진 20장을 가져다 두세요